import React from "react";

export default function Toman_withdrawal() {
	return (
		<div className="toman-withdrawal-container" dir="rtl">
			<div className="toman-withdrawal-right-side">
				<h4> انتقال به حساب بانکی</h4>
				<div>
					قابل برداشت: <span>0</span>ومان
				</div>
				<span>حداقل مبلغ قابل برداشت 50,000 تومان است.</span>
				<div>
					<span>مبلغ</span>
					<input type="number" />
				</div>
				<div>
					<span>کارت بانکی جهت واریز</span>
					<select>
						<option>کارت بانکی جهت واریز</option>
					</select>
					<span>لیست کارت بانکی های تایید شده را مشاهده میکنید.</span>
				</div>
				<div>
					<span>توضیحات اضافه</span>
					<textarea name="" id="" cols="30" rows="10"></textarea>
				</div>
				<input type="submit" />
			</div>
			<div className="toman-withdrawal-left-side">
				<h4> نکات و هشدارها</h4>
				<hr />
				<ul>
					<li>
						دقت نمایید پس از ثبت درخواست، امکان لغو درخواست وجود نداشته و وجه
						درخواستی بلافاصله از کیف پول شما کسر می گردد.
					</li>
					<li>
						پس از ثبت، درخواست شما به واحد مالی اعلام شده و مبلغ درخواستی به
						حساب بانکی شما واریز خواهد شد.
					</li>
					<li>
						برای پیگیری درخواست میتوانید به بخش تیکت ها و یا لیست تراکنش ها
						مراجعه کنید.
					</li>
					<li>
						از تاریخ شنبه مورخه ۴ مرداد ماه تمامی سفارت فروش و برداشت به بانک
						های غیر از ملی و ملت بصورت پایا واریز خواهد شد اما هر کاربر روزانه 1
						بار حق برداشت بصورت کارت به کارت تا سقف 300,000 تومان برای هر بانکی
						را دارد.
					</li>
					<li>
						سفارشات فروش و برداشت از کیف پول به مقصد بانک آینده زیر ۲۰ دقیقه
						انجام خواهد شد‌.
					</li>
					<li>
						مابقی بانک ها طبق سیکل پایا بانک مرکزی طی فرمول ذیل به حساب واریز
						میشود.
					</li>
					<li>از ساعت 00:00 تا 10:30 صبح ساعت 11:15 صبح واریز میشود.</li>
					<li>از 10:31 تا 12:00 ساعت 14:00 واریز میشود.</li>
					<li>
						از 12:01 ظهر تا 23:59 فردای آن روز ساعت 04:00 صبح واریز میشود.
					</li>
					<li>
						توصیه میشود برای دریافت آنی وجه از بانک آینده استفاده نمایید‌. با
						تشکر
					</li>
				</ul>
			</div>
		</div>
	);
}
